Revit 2027 API
DuctSizeSettings.GetSizeCount Method
 Get the size count of the duct size table. The duct shape determines the location of the size in the size table.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int GetSizeCount(
	DuctShape shape
)
Public Function GetSizeCount (
	shape As DuctShape
) As Integer
public:
int GetSizeCount(
	DuctShape shape
)
member GetSizeCount :
        shape : DuctShape -> int
Parameters
shape DuctShape
 The shape of duct.
Return Value
Int32
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
DuctSizeSettings Class
Autodesk.Revit.DB.Mechanical Namespace